{
    "version": "https://jsonfeed.org/version/1",
    "title": "Creative Writing Final",
    "description": "",
    "home_page_url": "https://aidenschramm.com/creativewritingfinal",
    "feed_url": "https://aidenschramm.com/creativewritingfinal/feed.json",
    "user_comment": "",
    "author": {
        "name": "Aiden Schramm"
    },
    "items": [
        {
            "id": "https://aidenschramm.com/creativewritingfinal/journals.html",
            "url": "https://aidenschramm.com/creativewritingfinal/journals.html",
            "title": "Journals",
            "summary": " Unit 1A Through the feedback I have received during the two times I took integrated composition, I can conclude that the quality of my writing is more or less sufficient. However I still have yet to be able to consistently deliver assignments by the&hellip;",
            "content_html": "<ul>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Unit 1A</span>\n<ul>\n<li style=\"font-weight: 400;\" aria-level=\"2\"><span style=\"font-weight: 400;\">Through the feedback I have received during the two times I took integrated composition, I can conclude that the quality of my writing is more or less sufficient. However I still have yet to be able to consistently deliver assignments by the due date. Though difficult, I would like to improve the consistency of when I turn in assignments by a significant amount.</span></li>\n</ul>\n</li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Unit 1B</span>\n<ul>\n<li style=\"font-weight: 400;\" aria-level=\"2\"><span style=\"font-weight: 400;\">Being able to experience other stories was useful for getting ideas and strategies to incorporate into my own writing. Additionally, having my story read aloud was extremely helpful in my own evaluation of the stories overall flow and voice. Specifically, there are several locations where I overuse singular and plural forms of “it” and “they” where clarifying the subject would be more appropriate.</span></li>\n</ul>\n</li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Unit 1C</span>\n<ul>\n<li style=\"font-weight: 400;\" aria-level=\"2\"><span style=\"font-weight: 400;\">Another aspect that could be improved is the use of emotive language to further draw in the reader. As it stands, a somewhat neutral tone is used throughout the narrative, with very little to which one could relate to emotionally. Overall, the improvements that could be made would take very little time and effort to complete, and will drastically improve the readability and overall flow of the story. All that remains to be done is to simply create an appropriate conclusion to wrap everything up.</span></li>\n</ul>\n</li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Unit 2A</span>\n<ul>\n<li style=\"font-weight: 400;\" aria-level=\"2\"><span style=\"font-weight: 400;\">After‌ ‌a‌ ‌fair‌ ‌bit‌ ‌of‌ ‌deliberation,‌ ‌I‌ ‌will‌ ‌most‌ ‌likely‌ ‌elect‌ ‌to‌ ‌create‌ ‌a‌ ‌long-form‌ ‌fiction‌ ‌piece.‌ ‌Once‌ ‌I‌ ‌begin‌ ‌writing,‌ ‌I‌ ‌find‌ ‌it‌ ‌extremely‌ ‌difficult‌ ‌to‌ ‌perform‌ ‌any‌ ‌sort‌ ‌of‌ ‌context-switch‌ ‌to‌ ‌anything‌ ‌different,‌ ‌meaning‌ ‌that‌ ‌I‌ ‌would‌ ‌probably‌ ‌struggle‌ ‌to‌ ‌complete‌ ‌more‌ ‌than‌ ‌one‌ ‌piece‌ ‌of‌ ‌fiction‌ ‌thanks‌ ‌to‌ ‌the‌ ‌overhead‌ ‌introduced‌ ‌by‌ ‌performing‌ ‌such‌ ‌a‌ ‌pivot.‌ ‌This‌ ‌journal‌ ‌is‌ ‌retrospective‌ ‌in‌ ‌nature‌ ‌as‌ ‌I‌ ‌have‌ ‌already‌ ‌completed‌ ‌my‌ ‌fiction‌ ‌piece,‌ ‌however‌ ‌this‌ ‌is‌ ‌an‌ ‌accurate‌ ‌reflection‌ ‌of‌ ‌the‌ ‌process‌ ‌of‌ ‌deliberation‌ ‌I‌ ‌experienced‌ ‌while‌ ‌struggling‌ ‌to‌ ‌decide‌ ‌which‌ ‌task‌ ‌I‌ ‌would‌ ‌choose‌ ‌to‌ ‌complete.‌ ‌</span></li>\n</ul>\n</li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Unit 2B</span>\n<ul>\n<li style=\"font-weight: 400;\" aria-level=\"2\"><span style=\"font-weight: 400;\">Being able to experience other stories was useful for getting ideas and strategies to incorporate into my own writing. Additionally, having my story read aloud was extremely helpful in my own evaluation of the stories overall flow and voice. Specifically, there are several locations where I overuse singular and plural forms of “it” and “they” where clarifying the subject would be more appropriate.</span></li>\n</ul>\n</li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Unit 2C</span>\n<ul>\n<li style=\"font-weight: 400;\" aria-level=\"2\"><span style=\"font-weight: 400;\">Making good use of point of view to construct a narrative is very important in creating a coherent and enjoyable written work. Both in my everyday interactions and my writing, I feel as if I have a decent grasp on how others may perceive situations differently. At the same time, I often struggle to see things exclusively from my own perspective, instead incorporating several different sources of detail into what I experience. Obviously it is impossible to literally experience life as another person, yet merely entertaining the idea of experiencing the life of another is a conduit to fostering a connection through which one can write about the subjective experience of an individual.</span></li>\n</ul>\n</li>\n</ul>",
            "author": {
                "name": "Aiden Schramm"
            },
            "tags": [
            ],
            "date_published": "2021-05-21T08:33:03-05:00",
            "date_modified": "2021-05-21T08:33:03-05:00"
        },
        {
            "id": "https://aidenschramm.com/creativewritingfinal/the-impossible-burger.html",
            "url": "https://aidenschramm.com/creativewritingfinal/the-impossible-burger.html",
            "title": "The Impossible Burger",
            "summary": " “Eat or be eaten”, an axiom as old as language itself. The strong dominate, while those too weak to resist are subjugated to the whims of the powerful. Alex had seen this statement crop up in a variety of places over the years, but&hellip;",
            "content_html": "<p><span style=\"font-weight: 400;\">    </span><span style=\"font-weight: 400;\">“Eat or be eaten”, an axiom as old as language itself. The strong dominate, while those too weak to resist are subjugated to the whims of the powerful. Alex had seen this statement crop up in a variety of places over the years, but he certainly did not expect to be considering such a philosophical quandary while being inches away from something </span><i><span style=\"font-weight: 400;\">literally</span></i><span style=\"font-weight: 400;\"> trying to eat him. Right on his heels was an enormous heaping mass of artificial, lab-made, and self-replicating hamburger meat.</span></p>\n<p><span style=\"font-weight: 400;\">    Just an hour prior, the fast food restaurant he worked at had just received their first shipment of fully lab-grown meat. His manager had made the decision to partner up with a local bioengineering lab to serve these artificial burgers, with the promise of cheap, easily refrigerated, and cruelty-free meat. Unfortunately for all parties involved, cross-contamination between the labs’ production lines and the genetic engineering division had introduced some unique properties into what should have been delicious, non face-eating patties. Trace amounts of HeLa cells and dust mite genetic material had made their way into the first batch. The introduction of these factors alone would not have been enough to birth the meaty monstrosity, however an intern mistakenly introduced several ounces of mayonnaise by attempting to add the dressing to his sub sandwich, accidentally spilling most of it into the vat containing the meat. As the oozing mixture lurched along the conveyor belt into the refrigeration unit, the perfect circumstances for temporary preservation emerged. Though it would become dormant for the time being, the biological monstrosity would remain ready to spring to life should it thaw out. Fortunately for it, barely more than half a day would pass before it’s meaty, mutated form was slapped upon a searing hot grill. </span></p>\n<p><span style=\"font-weight: 400;\">    The subsequent denaturation of the mayonnaise acted as the catalyst for the awakening of the creature, which promptly began moving and twitching before finally achieving “consciousness”. It then began its search for that which it had been biologically programmed to eat: human flesh. Alex and his co-worker Josh were the unlucky souls to be working in the kitchen that evening. Each wielding a pair of stainless steel spatulas, they parried the relentless attacks of the hunk of meat and eventually managed to seal it inside the grease trap. The lonesome patty was no match for the two, but alas, the rest of the meat had been slowly thawing out nearby, and had just reached the ideal temperature. Oozing and sloshing, it hauled its monstrous form out of the large metallic container in which it had arrived, plopping onto the floor with a wet slap. Startled by the sound from behind them, Alex and Josh whipped around towards the source of the noise, mouths agape with horror as they saw the slimy creature wiggling its way towards them. Without missing a beat, they grabbed pots, pans, plates, anything they could get their hands on, and lobbed them at the beast. Enraged by the onslaught of improvised projectile weaponry, the monster stopped abruptly and trembled violently for a moment, then spawned several smaller clumps of meat from its flesh. It was at this point that they realized that even with coordination and strategy, there was no feasible way the two of them could take on the mountain of meat. </span></p>\n<p><span style=\"font-weight: 400;\">     And so began the chase, bolting out of the kitchen faster than they had ever ran in their lives with the mutated monstrosities hot on their heels. Just prior to unleashing hamburger armageddon Josh and Alex had finished closing up for the night, as such there were thankfully no patrons left to witness this traumatizing event. Even more fortunate was the fact that Alex had just mopped the linoleum floor, leaving it slick with soapy water. The two rounded the corner with relative ease, while the miscreations went sliding towards the far end of the restaurant, the first coming to a sudden halt as it slammed into a booth and the rest mashing into it one after the other. With a rather dramatic squelching sound, the individual clumps of meat recombined to become an even greater behemoth than before. However, even with the additional mass, it had no way to gain any traction, only being able to bounce itself like a pinball between the tables and booths littering the establishment. As the creature flopped and flailed about, the disgruntled employees began to hatch a plan to deal with it once and for all. </span></p>\n<p><span style=\"font-weight: 400;\">    Firstly, they returned to the kitchen to deal with the lump of meat that remained stuck in the grease trap. Josh scooped it up with a large pot and Alex quickly slammed the lid on top, confining it once more. Returning to the seating area, they removed the lid and launched the tiny clump covered in grease towards its muculent progenitor. At that very moment, though it lacked all but the most basic of ingrained instincts, that miniscule clump of meat sailing gracefully through the air could be said to have been the happiest patty to have ever “lived”. It rejoined the original mass with a juicy smack, becoming a single large target. Next, they grabbed every single bag of flour they could find in the pantry, two long aluminum poles scavenged from dusters, and spools of wire from the maintenance kit. The plan was to create a “dust explosion” using the flour as material and an electric arc as the ignition. Alex carefully wrapped exposed wire around the base of both poles, wrapped both his arms with plastic garbage bags and used strips of the plastic to insulate the length of both poles from each other, leaving only the very tip exposed. Finally, he propped them up diagonally against a table, taking care not to get too close to the struggling pile of meat. Josh brought the flour, handed two already-open bags to Alex, and together they heaved the fine white powder into the air. Retreating behind the front counter, Alex plugged the exposed ends of wire into a nearby electrical outlet while Josh covered his ears, bracing for the noise. </span></p>\n<p> </p>\n<p><span style=\"font-weight: 400;\">    With a roar, the flour ignited and just about disintegrated everything in the immediate vicinity, shattering the closest windows and coating the interior of the restaurant with a fine layer of extremely well-done hamburger. Alex and Josh slowly came to their feet, observing the destruction they had wrought upon the creature and their surroundings. None of the meat twitched or moved, the malicious meat monster had been vanquished. </span></p>\n<p> </p>\n<p><span style=\"font-weight: 400;\">    “Well,”  remarked Alex, breaking the silence. “I think I might become a vegetarian after this.”</span></p>",
            "author": {
                "name": "Aiden Schramm"
            },
            "tags": [
            ],
            "date_published": "2021-05-21T08:18:22-05:00",
            "date_modified": "2021-05-21T08:18:22-05:00"
        },
        {
            "id": "https://aidenschramm.com/creativewritingfinal/everything-i-am.html",
            "url": "https://aidenschramm.com/creativewritingfinal/everything-i-am.html",
            "title": "Everything I Am",
            "summary": " Seated upon the well-worn, musty bench, with many others in similar condition lining the old school bus, I gazed out the window at the unfamiliar landscape. The air carried the smells and sounds of a dense city, though as the journey progressed these were&hellip;",
            "content_html": "<p><span style=\"font-weight: 400;\">    </span><span style=\"font-weight: 400;\">Seated upon the well-worn, musty bench, with many others in similar condition lining the old school bus, I gazed out the window at the unfamiliar landscape. The air carried the smells and sounds of a dense city, though as the journey progressed these were drowned out by a refreshing tropical breeze coupled with the sounds of the forest as the sun slowly dipped below the horizon. We had arrived in the capital of Nicaragua, Managua, and we were en-route to that which was to be our home away from home for the next two weeks. A great many thoughts were running through my head, of which none I could possibly manage to grasp and hold on to long enough to make heads or tails of it. Yet still one feeling dominated everything else. I was “in my element” so to speak. Somewhere I could simply do something, with the tantalizing promise of real impact upon the world. Certainly these were lofty ambitions for an 8th grader, but those were my goals and I was determined to do my absolute best to achieve them. As the roads progressed from smooth concrete, to bumpy asphalt, to heaps of gravel barely keeping the plants at bay, I continued pondering what my time in the country would be like. Finally, after turning onto a dirt driveway riddled with tire tracks of varying sizes, we approached the farm where we would be staying. The bus doors creaked open, and our group was greeted by the farmers and their very enthusiastic dogs. After unloading our supplies and preparing for sleep, the night culminated in another greeting, this time in the form of a markedly less friendly scorpion in the washroom. Everyone slept with one eye open that night. </span></p>\n<p><span style=\"font-weight: 400;\">    </span><span style=\"font-weight: 400;\">Come morning, we woke and got ready for the day ahead at the crack of dawn, mostly thanks to the roosters in the coop barely 10 meters from us. We discussed several things as we ate a delicious breakfast, and laid out a plan for our travels. The trusty school bus we had ridden on was to be our main method of transportation, ferrying us from the mountainous peaks of the north to the grassland plains of the south. Though we had brought with us a number of medical supplies, we still needed to obtain a number of items which we could not bring with us on the plane. As such, we followed the same route taken the day prior back to Managua to get to the pharmacy. Afterwards, we met with representatives of the church with whom we had partnered to conduct this mission trip, and discussed the logistics of our planned journey. Accompanying us was to be two members of the church who were able to act as translators, with myself filling in as needed. Finally, we set off to our first destination, which was not very far from the church itself. The pastor unlocked the sturdy iron frame protecting the door, opened the ornate door with a creek, and we shuffled inside. So began our journey throughout the country, the day after we left from Managua and traveled to Somoto, where we set up a clinic at La Carbonera, a nearby school. Next, we traveled through Valle Cacauli and La Gorza, though it was a few days before we were able to set up another clinic. To reach our next destination, Las Joyas, we embarked on a bumpy ride through the arid Nicaraguan countryside. Being so far from the nearest city there was a total lack of any vehicles whatsoever, everyone we came across while driving was riding a carriage drawn by either horse, donkey, or ox. The last clinic we hosted was at El Bonete, which was located in a village right on the banks of the Rio del Gallo named Somotillo. To reach the village, we had to drive through said river in the bus as there was no bridge across. These 4 locations where we established our temporary clinics were miles and miles away from the nearest hospital, without any means to make the treacherous journey save from by horseback. We traveled from border to border and coast to coast, administering medical aid to everyone we were able to treat at the villages. </span></p>\n<p><span style=\"font-weight: 400;\">   I was unable to truly grasp the magnitude of our actions at the time. The experience, the work, the people, the place, everything felt like one giant confusing mess. In retrospect, a mission trip to a foreign country is certainly quite the undertaking, but I sincerely put forth as much effort as I possibly could to improve the lives of those I met. To this day I cherish the fact that I had the opportunity to utilize my skills to the fullest extent possible in aiding people and communities in need.</span></p>",
            "author": {
                "name": "Aiden Schramm"
            },
            "tags": [
            ],
            "date_published": "2021-05-21T08:17:08-05:00",
            "date_modified": "2021-05-21T08:17:08-05:00"
        }
    ]
}
